//TECN106J JOB NOTIFY=&SYSUID
//JOBPROC JCLLIB ORDER=IBMUSER.ALL1
//COBCL EXEC IGYWCL,
//     PGMLIB=TECN106.COBOL.LOADLIB,                  DLIB NAME
//     COPYLIB=TECN106.L1J.SHARE.PS1,            B NAME
//     GOPGM=CA11G106                                AME
//COBOL.SYSIN DD DSN=TECN106.L1J.SHARE(CA11G106),DISP=SHR
//*LKED.SYSLIB DD DSN=TECN106.COBOL.LOADLIB(CA21G106),DISP=SHR
